In [257]:
import pandas as pd
import math

In [258]:
dataNy = {
    'NY': [3.8, 3.76, 3.87, 3.99, 4.02, 4.25, 4.13, 3.98, 3.99, 3.62],
}

In [259]:
dataLa = {
    'LA': [3.02, 3.22, 3.24, 3.02, 3.06, 3.15, 3.81, 3.44],
}

In [260]:
dfLa = pd.DataFrame(data=dataLa)
dfLa.head(11)

     LA
0  3.02
1  3.22
2  3.24
3  3.02
4  3.06
5  3.15
6  3.81
7  3.44

In [261]:
dfLa.sum()

LA    25.96
dtype: float64

In [262]:
dfNy = pd.DataFrame(data=dataNy)
dfNy.head(11)

     NY
0  3.80
1  3.76
2  3.87
3  3.99
4  4.02
5  4.25
6  4.13
7  3.98
8  3.99
9  3.62

In [263]:
dfNy.sum()

NY    39.41
dtype: float64

In [264]:
df = pd.concat([dfNy, dfLa], axis=1)
df.head(11)

     NY    LA
0  3.80  3.02
1  3.76  3.22
2  3.87  3.24
3  3.99  3.02
4  4.02  3.06
5  4.25  3.15
6  4.13  3.81
7  3.98  3.44
8  3.99   NaN
9  3.62   NaN

In [265]:
df.sum()

NY    39.41
LA    25.96
dtype: float64

In [266]:
meanNy = df['NY'].sum() / 10
meanNy

3.941

In [267]:
meanLa = df['LA'].sum() / 8
meanLa

3.245

In [268]:
df['pre_varianceNy'] = (df['NY'] - meanNy) ** 2
df.head()

     NY    LA  pre_varianceNy
0  3.80  3.02        0.019881
1  3.76  3.22        0.032761
2  3.87  3.24        0.005041
3  3.99  3.02        0.002401
4  4.02  3.06        0.006241

In [269]:
df['pre_varianceLa'] = (df['LA'] - meanLa) ** 2

In [270]:
varianceNy = df['pre_varianceNy'].sum() / (10 - 1)
varianceNy

0.03383222222222222

In [271]:
varianceLa = df['pre_varianceLa'].sum() / (8 - 1)
varianceLa

0.07177142857142857

In [272]:
stdNy = math.sqrt(varianceNy)
stdNy

0.18393537512458613

In [273]:
stdLa = math.sqrt(varianceLa)
stdLa

0.26790190102242384

In [274]:
df.describe()

              NY        LA  pre_varianceNy  pre_varianceLa
count  10.000000  8.000000       10.000000        8.000000
mean    3.941000  3.245000        0.030449        0.062800
std     0.183935  0.267902        0.038421        0.105681
min     3.620000  3.020000        0.001521        0.000025
25%     3.817500  3.050000        0.003061        0.006925
50%     3.985000  3.185000        0.013061        0.036125
75%     4.012500  3.290000        0.034981        0.050625
max     4.250000  3.810000        0.103041        0.319225

In [275]:
pooled_variance = (((10 - 1) * varianceNy) + ((8 - 1) * varianceLa)) / (10 + 8 - 2)
pooled_variance

0.05043062499999999

In [276]:
std_pooled = math.sqrt(pooled_variance)
std_pooled

0.2245676401443449

In [277]:
variables_T_1 = (10 + 8 - 2)
variables_T_1

16

In [278]:
variables_T_2 = 0.1 / 2
variables_T_2

0.05

In [279]:
T = (variables_T_1, variables_T_2)
T = 1.746
confidence_interval_A = (meanNy - meanLa) - (T * math.sqrt((pooled_variance / 10 + pooled_variance / 8)))  
confidence_interval_A

0.5100129638373615

In [280]:
confidence_interval_B = (meanNy - meanLa) + (T * math.sqrt((pooled_variance / 10 + pooled_variance / 8)))
confidence_interval_B

0.881987036162638

In [281]:
print(f'Confidence Interval of 90% = {confidence_interval_A}, {confidence_interval_B}')

Confidence Interval of 90% = 0.5100129638373615, 0.881987036162638